Revit 2024 API
BuiltInFailures.RebarFailures.SketchNonPlanarFreeForm Property
 The selected free form rebar is not planar. Sketching it will discard the current geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SketchNonPlanarFreeForm { get; }
Visual Basic
Public Shared ReadOnly Property SketchNonPlanarFreeForm As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SketchNonPlanarFreeForm {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace